Revit 2026 API

# LoadCaseSubcategoryId Property

---

Build-in or user defined subcategory of Structural Load Cases (OST_LoadCases) category.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId SubcategoryId { get; set; }
```
```vb
Public Property SubcategoryId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ SubcategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member SubcategoryId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: the subcategoryId does not refer to predefined nor user defined load case category element. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Build-in Structural Load Cases (OST_LoadCases) subcategories are: OST_LoadCasesDeadOST_LoadCasesLiveOST_LoadCasesWindOST_LoadCasesSnowOST_LoadCasesRoofLiveOST_LoadCasesAccidentalOST_LoadCasesTemperatureOST_LoadCasesSeismic

#### Reference

LoadCase Class

Autodesk.Revit.DB.Structure Namespace